Feature: Управление на Категории

  Scenario: Създаване на категория от администратор без име
    Given В системата влизаме с администраторски профил
    And Отваряме екрана за създаване на категории
    When натискаме бутона за създаване
    Then Вижда съобщение: "Въведете име на категорията"
 
 
 Scenario: Създаване на категория от потребител без име
    Given В системата влизаме с потребителски профил
    And Отваряме екрана за създаване на категории
    When натискаме бутона за създаване
    Then Вижда съобщение: "Нямате права да създавате категория"
    
    
    Scenario: Създаване на категория от администратор с име
    Given В системата влизаме с администраторски профил
    And Отваряме екрана за създаване на категории
    When Въведе име на категория: "Категория1"
    And натискаме бутона за създаване
    Then Вижда съобщение: "Успешно създадохте категория"
 
 
 Scenario: Създаване на категория от потребител с име
    Given В системата влизаме с потребителски профил
    And Отваряме екрана за създаване на категории
    When Въведе име на категория: "Категория1"
    And натискаме бутона за създаване
    Then Вижда съобщение: "Нямате права да създавате категория"