Feature: Вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    Given Потребителя отваря екрана за вход в системата
    When Веведе валидно потребителско име
    And въведе валидна парола
    And натисне бутона за вход в системата
    Then Вижда съобщение за успех
    
  Scenario: Вход в системата с невалидни потребителски данни
    Given Потребителя отваря екрана за вход в системата
    When Веведе невалидно потребителско име
    And въведе валидна парола
    And натисне бутона за вход в системата
    Then Вижда съобщение за решни данни

	Scenario: Вход в системата без потребителско име
    Given Потребителя отваря екрана за вход в системата
    When въведе валидна парола
    And натисне бутона за вход в системата
    Then Вижда съобщение за липса на данни
    
	Scenario: Вход в системата без парола
    Given Потребителя отваря екрана за вход в системата
    When Веведе валидно потребителско име
    And натисне бутона за вход в системата
    Then Вижда съобщение за липса на данни
    
	Scenario: Вход в системата без парола
    Given Потребителя отваря екрана за вход в системата
    When натисне бутона за вход в системата
    Then Вижда съобщение за липса на данни