Feature: Вход в системата

	Background:
    Given Потребителя отваря екрана за вход в системата


  Scenario: Вход в системата с валидни потребителски данни
    When Веведе "Иван" потребителско име
    And въведе "Pass124!" парола
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Успешно влязохте в систематa!"
    
  Scenario: Вход в системата с невалидни потребителски данни
    When Веведе "MissingUsername" потребителско име
    And въведе "Pass124!" парола
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Грешни данни!"
    
  Scenario: Вход в системата с невалидна парола
    When Веведе "Иван" потребителско име
    And въведе "грешна парола" парола
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Грешни данни!"

	Scenario: Вход в системата без потребителско име
    When въведе "Pass124!" парола
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете име и парола!"
    
	Scenario: Вход в системата без парола
    When Веведе "Иван" потребителско име
    And натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете име и парола!"
    
	Scenario: Вход в системата без парола
    When натисне бутона за вход в системата
    Then Вижда съобщение: "Въведете име и парола!"